export const aboutMeText = [
  `Владею основными технологиями web-разработки: 
JS, HTML, CSS, React, TypeScript, Redux, Redux-Toolkit, MobX, Ant Design, Mui, Vue.js, Git, Node.js, Express.
Всегда готов изучать что-то новое.`,

  `Выбрал frontend-разработку, потому что мне всегда нравилось пересечение дизайна и технологий.
Отношусь к разработке как к решению логических задач, где если все сделать правильно, то все сложится.
В работе и жизни стараюсь декомпозировать задачи.
Ценю ваше и своё время, быстро нахожу свое место в команде.`,
  `Участвовал в стажировке от Сбермаркет и успешно прошел буткемп от red_mad_robots. Это дало мне ценный опыт работы в команде и тайм менеджменту.
Сейчас работаю frontend разработчиком в компании Hi-Tech и код ревьюером в Яндекс.Практикум на курсе веб разработчик.`,
  `Люблю путешествовать, кататься на роликах и сноуборде.`,
  `В прошлом работал в Московском Планетарии. Где сталкивался с реализацией интерфейсов и разработкой решений для автоматизации задач.`,
];
