export const aboutMeText = [
  `Меня зовут Денисов Евгений. Я Frontend разработчик.`,
  `9 лет проработал в Московском Планетарии, сначала инженером, а затем программистом астросимулятора.`,
  `В 2017 году начал
  заниматься frontend разработкой в качестве хобби и для небольших подработок на фрилансе.`,
  `Я
  выбрал frontend-разработку, потому что мне всегда нравилось пересечение дизайна и
  технологий, так же потому, что сразу виден результат моей работы.`,
  `Участвовал в стажировке от
  Сбермаркет и успешно прошел буткемп от Red Mad Robots. Это дало мне ценный опыт работы в
  команде и тайм менеджменту.`,
  `В данный момент работаю frontend разработчиком в компании
  Hi-Tech и код ревьюером в Яндекс.Практикум на курсе веб разработчик.`,
  `Люблю путешествовать,
  кататься на роликах и сноуборде. Открыт для предложений о работе.`,
];
