export const studentFeedback = [
  {
    rating: 5,
    text: ``,
  },
  {
    rating: 1,
    text: `Не понравилось ревью. Рабочий вариант не устраивает, просят переделать, но почему/для чего, а главное какое должно быть альтернативное решение не говорят.`,
  },
  {
    rating: 1,
    text: `Ревьюер пишет непонятно, не приводит примеров или кода объясняющих что нужно сделать, например:
>> Если хотите очищать форму от ошибок валидации при открытии, в функцию следует передавать объект настроек валидации.
  Функция работает как надо, что сделать чтобы пройти ревью - неясно.`,
  },
  {
    rating: 5,
    text: `Большое спасибо за быструю и качественную проверку!`,
  },
  {
    rating: 5,
    text: ``,
  },
  {
    rating: 5,
    text: `Огромное спасибо Евгению за оперативную обратную связь! в первой итерации работу проверил всего за час, я была в шоке! Вежливое общение, понятная обратная связь, было приятно работать!`,
  },
  {
    rating: 5,
    text: `Очень хорошее ревью.  Быстро и с подробным описанием проблем. Теперь всё стало гораздо понятнее. Спасибо!`,
  },
  {
    rating: 5,
    text: `Все очень понравилось. Быстрое ревью и понятные комментарии от ревьювера.`,
  },
  {
    rating: 5,
    text: `Вы не закрыли работу. Исправьте пожалуйста`,
  },
  {
    rating: 5,
    text: `Ревью понравилось,  все замечания обоснованные.`,
  },
  {
    rating: 5,
    text: `Быстро, красава)
    Правда замечания в основном, по прошлым спринта. Но спасибо.`,
  },
  {
    rating: 5,
    text: `Хочу поблагодарить Евгения Денисова за ревью. Очень быстро проверил работу (все 4 раза, как и в прошлом спринте). Комментарии очень помогли разобраться с ошибками и с пониманием js в целом) 
    Еще я убедился, что я невнимательный) Отдельное спасибо Евгению, за терпение)`,
  },
  {
    rating: 5,
    text: `Ревью понравилось, все замечания по делу. Евгений Денисов помог разобраться с валидацией и передачей переменных в функции. Большое спасибо!`,
  },
  {
    rating: 5,
    text: ``,
  },
  {
    rating: 5,
    text: `Отличное ревью, помогло понять где я недопонял! Огромное спасибо!`,
  },
  {
    rating: 5,
    text: `Spasibo`,
  },
  {
    rating: 5,
    text: `Благодарю за конструктивные замечания и важные практические советы!`,
  },
  {
    rating: 5,
    text: ``,
  },
  {
    rating: 5,
    text: `ОТЛИЧНЫЙ РЕВЬЮЕР`,
  },
  {
    rating: 5,
    text: ``,
  },
  {
    rating: 5,
    text: `Ревью проводил Евгений Денисов, подробно описал ошибки, смогла быстро исправить. Спасибо.`,
  },
  {
    rating: 5,
    text: `отзыв всей команде яндекса или конкретно ревьюверу? Команде - поменьше косяков и неточностей в задании и неплохо бы иметь информацию о том, кто приоритетнее из: задание, фигма, чеклист, фото\\видео из задания. Ревьюверам - пожелать терпения и крепких нервов, т.к. мы студенты не всегда всё сразу видим и не всегда понимаем что от нас хотят. От ревьюверов - ссылаться на нарушенный раздел задания\\фигмы\\чеклиста, т.к. исправлять то что не запрещено - ужасно раздражает и отнимает время.`,
  },
  {
    rating: 5,
    text: ``,
  },
  {
    rating: 5,
    text: ``,
  },
  {
    rating: 5,
    text: ``,
  },
  {
    rating: 5,
    text: ``,
  },
  {
    rating: 5,
    text: `Спасибо за помощь. Учту все рекомендации.`,
  },
  {
    rating: 5,
    text: `Спасибо Евгению за полезные и развернутые комментарии по улучшению работы и отдельная благодарность за скорость проверки)`,
  },
  {
    rating: 5,
    text: `Отличные комментарии по улучшению,  разберусь и обязательно применю!
Евгению спасибо за супер оперативность)`,
  },
  {
    rating: 5,
    text: ``,
  },
  {
    rating: 5,
    text: `Спасибо за понятные комментарии, быстрые проверки, корректное общение!`,
  },
  {
    rating: 5,
    text: `Евгений, спасибо за ревью!`,
  },
  {
    rating: 5,
    text: ``,
  },
  {
    rating: 5,
    text: ``,
  },
  {
    rating: 5,
    text: `Спасибо, Евгений! Отличное ревью!`,
  },
  {
    rating: 5,
    text: `Евгений, как всегда отличное ревью! Спасибо за помощь в улучшении моего кода и, в целом, в понимании как работает javascript.`,
  },
  {
    rating: 5,
    text: `Евгений, огромное спасибо за ревью и помощь!`,
  },
  {
    rating: 5,
    text: `Это просто невероятно  тошто я написал в самом начале и то что сейчас просто как небо и земля я не знал что создание 6 карточек может уместиться в одну сточку кода это просто круто вы отличный Ревьювер благодарность от меня огромная!!!`,
  },
  {
    rating: 5,
    text: `Большое спасибо за быстрое ревью!`,
  },
  {
    rating: 5,
    text: `Спасибо за классное ревью моего кода.. После наводок на мысли как можно провести рефакторинг кода функций, код стал более лаконичным и читаемым. Появилось понимание зачем и почему лучше использовать те или иные аргументы. Супер! Мне понравилось.`,
  },
  {
    rating: 5,
    text: `Евгений, спасибо.`,
  },
  {
    rating: 5,
    text: `Спасибо за ревью, сначала не совсем понял, что требовалось на первом-втором, но благодаря замечаниям и особенно совету обратиться к наставнику во всем разобрался. Возможно не хватило фундаментальных вещей, но после сдачи все стало на свои места и пришло понимание, что ревью прописано верно. 
Спасибо Евгению за ревью и поддержку, работаем дальше`,
  },
  {
    rating: 5,
    text: `В целом все ошибки были понятны, ревьюер постарался объяснить доходчиво что я делаю не так и почему нужно исправить. Работу на ревью взяли супербыстро, не прошло и часа с отправки на проверку, что очень удивило и обрадовало!`,
  },
  {
    rating: 5,
    text: ``,
  },
  {
    rating: 5,
    text: `Очень быстро проверили работу`,
  },
  {
    rating: 5,
    text: ``,
  },
  {
    rating: 5,
    text: `Ревью понравилось. Дельные советы, как сделать лучше. Замечания, которые необходимо было исправить, понятны.`,
  },
  {
    rating: 5,
    text: `Евгений, спасибо, за терпение и подробные объяснения.`,
  },
  {
    rating: 5,
    text: `Быстро, качественно и нашел ошибку предыдущей итерации`,
  },
  {
    rating: 5,
    text: `В этот раз работу проверял Евгений Денисов. Проверял быстро и профессионально. При первой проверке расписал много и подробно по недостаткам. При второй проверке несмотря на то, что работа была принята, он также расписал оч. подробно что можно улучшить. Замечания все по делу, когда исправляешь код сразу видишь насколько он становится лучше. Спасибо за то, что делитесь своим опытом!`,
  },
  {
    rating: 5,
    text: `Большое спасибо за ревью! Очень конструктивно, уяснила для себя некоторые моменты, на которые не обращала внимания ранее.`,
  },
  {
    rating: 5,
    text: `Все отлично! Спасибо Евгению, за внимательность и конструктивную критику!`,
  },
  {
    rating: 5,
    text: `Отлично, спасибо!`,
  },
  {
    rating: 1,
    text: ``,
  },
  {
    rating: 1,
    text: `Ревьюер не указал в коде что конкретно он имел ввиду, отписавшись общей фразой, если студент не понимает ,это не значит что нужно так ему писать ответ по ревью. 
    Дополнение, ревьюер находит ошибки пропущенные другими ревьюрами причем из спринтов которые были давно. И так же после первого ревью приходят ошибки - хорошо все поправили а потому приходят новые которые пропустили в первый раз, а в третий приходят снова новые ошибки`,
  },
  {
    rating: 5,
    text: `Всё отлично и понятно)`,
  },
  {
    rating: 5,
    text: ``,
  },
  {
    rating: 5,
    text: `Очень подробные пояснения по не критическим замечаниям.  Ревьюер любит свое ремесло и уважает чувство собственного достоинства учащегося. Приятно то, как быстро взялись за проверку и как тщательно проверяли.
Спасибо за такое отношение к моей работе!`,
  },
  {
    rating: 5,
    text: ``,
  },
  {
    rating: 5,
    text: `Спасибо Евгению за ревью! Смогла иначе посмотреть на организацию определенных моментов в коде и извлечь за себя полезное)`,
  },
  {
    rating: 5,
    text: `Крайне положительные впечатления от ревью.  замечания были понятными,  были приложены дополнительные материалы для повторения теории и решения замечаний. Благодарю за работу!`,
  },
  {
    rating: 5,
    text: `Скорость проверки впечатляет. Спасибо за подробные объяснения, с вами я становлюсь лучше.`,
  },
  {
    rating: 5,
    text: `Очень оперативное ревью. Все комментарии, что дал ревьюер, помогли исправить ошибки и направили к нужному решению недочетов кода.`,
  },
  {
    rating: 5,
    text: `Все супер`,
  },
  {
    rating: 5,
    text: `Как всегда, все на высочайшем уровне!`,
  },
  {
    rating: 5,
    text: `Спасибо Евгению Денисову за отличное ревью! Замечания написаны понятно и подробно. Они указали на очевидные ошибки из разряда 'где были мои глаза', так и неочевидные, которые помогли перестроить логику отдельных моментов и придать ей изящности, избавив от ненужной перегруженности и костылей. Удачи в работе!`,
  },
  {
    rating: 5,
    text: `Очень доступно указал на все неточности!`,
  },
  {
    rating: 5,
    text: `Отличное ревью, указаны ошибки, их последствия и каким образом их исправить, в том числе приводятся примеры способов разрешения.`,
  },
  {
    rating: 5,
    text: ``,
  },
  {
    rating: 5,
    text: `Очень хорошая проверка. Объяснения ошибок понятные и подробные`,
  },
  {
    rating: 5,
    text: `очень хорошее ревью!`,
  },
  {
    rating: 5,
    text: ``,
  },
  {
    rating: 5,
    text: ``,
  },
  {
    rating: 5,
    text: `Оперативное получен результат по ревью. Понятные замечание, есть рекомендации для улучшений.`,
  },
  {
    rating: 5,
    text: ``,
  },
  {
    rating: 5,
    text: `Оперативное ревью, понятные замечания.`,
  },
  {
    rating: 5,
    text: `Спасибо Евгению за ревью! Очень благодарен за советы по устранению замечаний!`,
  },
  {
    rating: 5,
    text: `Ревью отличное. Моя первая попытка была немного сумбурная, так как я в отпуске и еще немного приболел. Так еще я с версиями намудрил в гите, поэтому пришлось фиксить конфликты между ветками. Поэтому прошу прощения, если работа показалось странной`,
  },
  {
    rating: 5,
    text: ``,
  },
  {
    rating: 5,
    text: `Мой ревьюер Евгений Денисов
быстро проверил ПР и дал много советов как улучшить код. Спасибо!`,
  },
  {
    rating: 5,
    text: `Спасибо за ревью, я в полном восторге ^^`,
  },
  {
    rating: 5,
    text: ``,
  },
  {
    rating: 5,
    text: `спасибо за полезные комментарии`,
  },
  {
    rating: 5,
    text: `Большое спасибо ревьюеру за его работу! Комментарии были даны четко, понятно и полезно. Отдельное спасибо за Набережную Дивногорска, очень подняло настроение. Я бы сказал - это было лучшее ревью за все время которое я учусь на Практикуме.:)`,
  },
  {
    rating: 5,
    text: `Спасибо за содержательное ревью!`,
  },
  {
    rating: 5,
    text: `Спасибо за ценные замечания!`,
  },
  {
    rating: 5,
    text: `Спасибо большое за полезное и очень подробное ревью! :)`,
  },
  {
    rating: 5,
    text: `Спасибо большое за ревью Евгению Денисову!
Проверил работу быстро, качественно, дал ценные советы, которые я учту и, надеюсь, запомню надолго! 
Спасибо!`,
  },
  {
    rating: 5,
    text: `Евгений, здравствуйте! Большое спасибо вам за ревью, терпение, и что не лишили меня итерации за глупейшую ошибку)`,
  },
  {
    rating: 5,
    text: `Я хотел бы поблагодарить своего ревьюера за терпение и подробное объяснение моих ошибок в коде. Дай бог здоровья и счастья + мирного неба над головой + много тысяч денег.`,
  },
  {
    rating: 5,
    text: `Очень подробное и глубокое ревью, благодаря которому были исправлены даже многие проблемы из прошлых спринтов.`,
  },
  {
    rating: 5,
    text: `Очередной раз вижу, как взгляд профессионала на мою работу с указанием на слабые стороны помогает мне расти.
Ну и, конечно же, очень вдохновляет позитивная оценка работы в целом.
Спасибо, Евгений!`,
  },
  {
    rating: 5,
    text: ``,
  },
  {
    rating: 5,
    text: `Спасибо за ревью! Иногда было не совсем понятно, что нужно делать. Но в итоге я ощутила, что ревьюер хочет мне помочь и научить меня мыслить шире и универсальнее.`,
  },
  {
    rating: 5,
    text: `Спасибо за быстрое ревью и практические советы!`,
  },
  {
    rating: 5,
    text: `Спасибо за науку! 

Есть вещи в ООП, которые не так очевидны, как например создание экземпляра класса. В связи с этим код работает по другому, чем ты ожидаешь. Но сейчас стало всё на свои места.`,
  },
  {
    rating: 5,
    text: `Приятно было поработать!`,
  },
  {
    rating: 5,
    text: `Евгений, доброго времени суток! Большое спасибо вам за ревью! Ваши комментарии и замечания очень важны для меня и мого профессионального роста.`,
  },
  {
    rating: 5,
    text: `Евгений, спасибо за повторное ревью! Оно дало мне несколько новое понимание использования функций. Надеюсь все сделал правильно)`,
  },
  {
    rating: 5,
    text: `Евгений, спасибо за опыт! И вам всего самого наилучшего!`,
  },
  {
    rating: 5,
    text: ``,
  },
  {
    rating: 5,
    text: ``,
  },
  {
    rating: 5,
    text: ``,
  },
  {
    rating: 5,
    text: `Спасибо! Комментарии очень помогают лучше разобраться!`,
  },
  {
    rating: 5,
    text: `Спасибо`,
  },
  {
    rating: 5,
    text: `Очень долго не могла соединить в едино все ниточки, частями код получался очень топорный, благодаря Евгению и его развернутым пояснениям и добилась значительного успеха и разобралась в теме. Огромное ему спасибо за работу!`,
  },
  {
    rating: 5,
    text: `Очень быстрая проверка! Позитивный комментарий! Интересные предложения по улучшению кода.`,
  },
  {
    rating: 1,
    text: `Ничего не понимаю(приходится додумывать что ревьювер имел в виду) и 0 подсказок (а я не понимаю как можно только с цсс сделать резкое изменение "появление сообщения об ошибке в одну или две строки высотой не должно приводить к изменению
высоты модального окна. Если сообщение об ошибке от трёх строк высотой, то размер модального окна
увеличивается." - как это сделать без js я не понимаю и в инете ни на английском ни на русском не нашел)`,
  },
  {
    rating: 1,
    text: `Был бы чат с ревьювером было бы проще`,
  },
  {
    rating: 5,
    text: ``,
  },
  {
    rating: 5,
    text: `Надеюсь, что все замечания были не напрасны. Переделывать было не просто, но зато углубился в тему знатно. Всё ради роста навыков!`,
  },
  {
    rating: 5,
    text: `Круто! Вырвать победу из лап(ок) Ревьюера - для этого стоило родиться и жить!

На самом деле работа над своими ошибками и переосмысление _своего_ кода - самый важный этап обучения. ИМХО само собой.`,
  },
  {
    rating: 5,
    text: ``,
  },
  {
    rating: 5,
    text: `Спасибо за хорошее ревью.`,
  },
  {
    rating: 5,
    text: `Долговато проверяют`,
  },
  {
    rating: 5,
    text: `Евгений, спасибо огромное за ревью! Очень полезно, особенно наводка по поводу деструктуризации объектов!`,
  },
  {
    rating: 5,
    text: ``,
  },
  {
    rating: 5,
    text: `Спасибо за ревью!`,
  },
  {
    rating: 5,
    text: `Спасибо Евгению за ценные советы в обучении и  действительно сильное ревью!
Очень полезные ссылки и объеснения.`,
  },
  {
    rating: 5,
    text: `Ревью отличное, всё понятно.`,
  },
  {
    rating: 5,
    text: `мне понравился`,
  },
  {
    rating: 5,
    text: `Евгений Денисов очень хороший ревьюер! Самый позитивный и понятно объясняющий, где ошибка. Хочу выразить ему благодарность за поддержку и похвалу, тк во время выполнения практической у меня были трудности, но его слова, что работа вышла хорошей, подбодрили меня`,
  },
  {
    rating: 5,
    text: `Здравствуйте! Спасибо за объективное ревью.`,
  },
  {
    rating: 5,
    text: ``,
  },
  {
    rating: 5,
    text: `Спасибо за ревью! Замечания подробные,  наводят на мысли в верном направлении)`,
  },
  {
    rating: 5,
    text: `Спасибо за ревью`,
  },
  {
    rating: 5,
    text: `Хорошее ревью)`,
  },
  {
    rating: 5,
    text: ``,
  },
  {
    rating: 5,
    text: `Спасибо`,
  },
  {
    rating: 5,
    text: ``,
  },
  {
    rating: 5,
    text: `Хороший ревьюер , подбодрил с одного раза , мотивация учиться появилась все больше`,
  },
  {
    rating: 5,
    text: `Отличное ревью, все замечания по делу и сформулированы понятно`,
  },
  {
    rating: 5,
    text: ``,
  },
  {
    rating: 5,
    text: `Спасибо большое за внимательное ревью кода и конструктивные замечания`,
  },
  {
    rating: 5,
    text: `Евгений Денисов - спасибо за ревью. Как и во всех предыдущих ревью, в этом так-же были не просто указания на ошибки, но и возможные пути их исправления. Это в некоторой степени облегчает работу над ошибками. 
И вообще, за прошедшее время обучения, у меня   пока не было претензий к ревьюерам, чего не могу сказать  о наставниках.
Евгений Денисов - желаю Вам успехов в вашей работе.`,
  },
  {
    rating: 1,
    text: `Че за эльфийский ? -_-`,
  },
  {
    rating: 5,
    text: `<3`,
  },
  {
    rating: 5,
    text: ``,
  },
  {
    rating: 5,
    text: `Ревью, как всегда, на высшем уровне! Спасибо за поддержку!`,
  },
  {
    rating: 5,
    text: `Ревьювер понравился, комментарии чёткие и по делу! Все отлично`,
  },
  {
    rating: 1,
    text: `сложилось ощущение, что в моей работе нет никаких положительных моментов, что расстраивает.  js - новая тема, в которой местами сложно освоиться. хотелось бы получить немного положительного фидбека для поддержки мотивации к учебе`,
  },
  {
    rating: 5,
    text: ``,
  },
  {
    rating: 5,
    text: `Добрый день! Евгений хороший ревьюер.`,
  },
  {
    rating: 5,
    text: ``,
  },
  {
    rating: 5,
    text: `Самое подбадривающее из всех предыдущих ревью! Огромное спасибо, действительно вернулась мотивация`,
  },
].reverse();
